#include <stdio.h>

// 포인터를 사용하여 두 변수의 값을 교체하는 코드이다.
// 빈칸에 알맞은 코드를 쓰시오.

// int main () {
//   int a=10, b=20, temp;
//   int *pa = &a;
//   int *pb = &b;
//   temp = *pa;
//   [?];
//   *pb = temp;
//   return 0;
// }

/*---------------------------------------------------------*/
// 정답
/*---------------------------------------------------------*/
// [?]에 들어갈 말은?
// *pa = *pb

int main () {
  int a=10, b=20, temp;
  int *pa = &a;
  int *pb = &b;
  temp = *pa;
  *pa = *pb;
  *pb = temp;
  return 0;
}